garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1619.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1SETH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1SETH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x58D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1SET8" edc:desc="" edc:mask="0x1" edc:name="PID1SET8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET9" edc:desc="" edc:mask="0x1" edc:name="PID1SET9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET10" edc:desc="" edc:mask="0x1" edc:name="PID1SET10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET11" edc:desc="" edc:mask="0x1" edc:name="PID1SET11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET12" edc:desc="" edc:mask="0x1" edc:name="PID1SET12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET13" edc:desc="" edc:mask="0x1" edc:name="PID1SET13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET14" edc:desc="" edc:mask="0x1" edc:name="PID1SET14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1SET15" edc:desc="" edc:mask="0x1" edc:name="PID1SET15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SET8" edc:desc="" edc:mask="0x1" edc:name="SET8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET9" edc:desc="" edc:mask="0x1" edc:name="SET9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET10" edc:desc="" edc:mask="0x1" edc:name="SET10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET11" edc:desc="" edc:mask="0x1" edc:name="SET11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET12" edc:desc="" edc:mask="0x1" edc:name="SET12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET13" edc:desc="" edc:mask="0x1" edc:name="SET13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET14" edc:desc="" edc:mask="0x1" edc:name="SET14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SET15" edc:desc="" edc:mask="0x1" edc:name="SET15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PID1IN" edc:desc="" edc:name="PID1IN" edc:nzwidth="0x10" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x58E">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1INL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PID1INL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x58E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1IN0" edc:desc="" edc:mask="0x1" edc:name="PID1IN0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN1" edc:desc="" edc:mask="0x1" edc:name="PID1IN1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN2" edc:desc="" edc:mask="0x1" edc:name="PID1IN2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN3" edc:desc="" edc:mask="0x1" edc:name="PID1IN3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN4" edc:desc="" edc:mask="0x1" edc:name="PID1IN4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN5" edc:desc="" edc:mask="0x1" edc:name="PID1IN5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN6" edc:desc="" edc:mask="0x1" edc:name="PID1IN6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN7" edc:desc="" edc:mask="0x1" edc:name="PID1IN7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="IN0" edc:desc="" edc:mask="0x1" edc:name="IN0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN1" edc:desc="" edc:mask="0x1" edc:name="IN1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN2" edc:desc="" edc:mask="0x1" edc:name="IN2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN3" edc:desc="" edc:mask="0x1" edc:name="IN3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN4" edc:desc="" edc:mask="0x1" edc:name="IN4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN5" edc:desc="" edc:mask="0x1" edc:name="IN5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN6" edc:desc="" edc:mask="0x1" edc:name="IN6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN7" edc:desc="" edc:mask="0x1" edc:name="IN7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1INH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PID1INH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x58F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1IN8" edc:desc="" edc:mask="0x1" edc:name="PID1IN8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN9" edc:desc="" edc:mask="0x1" edc:name="PID1IN9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN10" edc:desc="" edc:mask="0x1" edc:name="PID1IN10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN11" edc:desc="" edc:mask="0x1" edc:name="PID1IN11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN12" edc:desc="" edc:mask="0x1" edc:name="PID1IN12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN13" edc:desc="" edc:mask="0x1" edc:name="PID1IN13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN14" edc:desc="" edc:mask="0x1" edc:name="PID1IN14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1IN15" edc:desc="" edc:mask="0x1" edc:name="PID1IN15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="IN8" edc:desc="" edc:mask="0x1" edc:name="IN8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN9" edc:desc="" edc:mask="0x1" edc:name="IN9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN10" edc:desc="" edc:mask="0x1" edc:name="IN10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN11" edc:desc="" edc:mask="0x1" edc:name="IN11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN12" edc:desc="" edc:mask="0x1" edc:name="IN12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN13" edc:desc="" edc:mask="0x1" edc:name="IN13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN14" edc:desc="" edc:mask="0x1" edc:name="IN14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="IN15" edc:desc="" edc:mask="0x1" edc:name="IN15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PID1K1" edc:desc="" edc:name="PID1K1" edc:nzwidth="0x10" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x590">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1K1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PID1K1L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x590">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1K10" edc:desc="" edc:mask="0x1" edc:name="PID1K10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K11" edc:desc="" edc:mask="0x1" edc:name="PID1K11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K12" edc:desc="" edc:mask="0x1" edc:name="PID1K12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K13" edc:desc="" edc:mask="0x1" edc:name="PID1K13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K14" edc:desc="" edc:mask="0x1" edc:name="PID1K14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K15" edc:desc="" edc:mask="0x1" edc:name="PID1K15" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K16" edc:desc="" edc:mask="0x1" edc:name="PID1K16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K17" edc:desc="" edc:mask="0x1" edc:name="PID1K17" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="K10" edc:desc="" edc:mask="0x1" edc:name="K10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K11" edc:desc="" edc:mask="0x1" edc:name="K11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K12" edc:desc="" edc:mask="0x1" edc:name="K12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K13" edc:desc="" edc:mask="0x1" edc:name="K13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K14" edc:desc="" edc:mask="0x1" edc:name="K14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K15" edc:desc="" edc:mask="0x1" edc:name="K15" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K16" edc:desc="" edc:mask="0x1" edc:name="K16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K17" edc:desc="" edc:mask="0x1" edc:name="K17" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1K1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PID1K1H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x591">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1K18" edc:desc="" edc:mask="0x1" edc:name="PID1K18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K19" edc:desc="" edc:mask="0x1" edc:name="PID1K19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K110" edc:desc="" edc:mask="0x1" edc:name="PID1K110" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K111" edc:desc="" edc:mask="0x1" edc:name="PID1K111" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K112" edc:desc="" edc:mask="0x1" edc:name="PID1K112" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K113" edc:desc="" edc:mask="0x1" edc:name="PID1K113" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K114" edc:desc="" edc:mask="0x1" edc:name="PID1K114" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1K115" edc:desc="" edc:mask="0x1" edc:name="PID1K115" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="K18" edc:desc="" edc:mask="0x1" edc:name="K18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K19" edc:desc="" edc:mask="0x1" edc:name="K19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K110" edc:desc="" edc:mask="0x1" edc:name="K110" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K111" edc:desc="" edc:mask="0x1" edc:name="K111" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K112" edc:desc="" edc:mask="0x1" edc:name="K112" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K113" edc:desc="" edc:mask="0x1" edc:name="K113" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K114" edc:desc="" edc:mask="0x1" edc:name="K114" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="K115" edc:desc="" edc:mask="0x1" edc:name="K115" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
