garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1619.PIC
        <edc:SFRDef edc:access="nnrrn-nn" edc:cname="SCANCON0" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="SCANCON0" edc:nzwidth="8" edc:por="00000-00" edc:_modsrc="DOS-02454_dma_nvm_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x71C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="INTM" edc:desc="" edc:mask="0x1" edc:name="INTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INVALID" edc:desc="" edc:mask="0x1" edc:name="INVALID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANGO" edc:desc="" edc:mask="0x1" edc:name="SCANGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANMODE" edc:desc="" edc:mask="0x3" edc:name="SCANMODE" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SCANINTM" edc:desc="" edc:mask="0x1" edc:name="SCANINTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANINVALID" edc:desc="" edc:mask="0x1" edc:name="SCANINVALID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANBUSY" edc:desc="" edc:mask="0x1" edc:name="SCANBUSY" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SCANEN" edc:desc="" edc:mask="0x1" edc:name="SCANEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SCANMODE0" edc:desc="" edc:mask="0x1" edc:name="SCANMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANMODE1" edc:desc="" edc:mask="0x1" edc:name="SCANMODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SCANTRIG" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SCANTRIG" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02454_dma_nvm_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x71D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSEL" edc:desc="" edc:mask="0xf" edc:name="TSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TSEL0" edc:desc="" edc:mask="0x1" edc:name="TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEL1" edc:desc="" edc:mask="0x1" edc:name="TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEL2" edc:mask="0x1" edc:name="TSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL3" edc:mask="0x1" edc:name="TSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANTSEL" edc:desc="" edc:mask="0xf" edc:name="SCANTSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SCANTSEL0" edc:desc="" edc:mask="0x1" edc:name="SCANTSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANTSEL1" edc:desc="" edc:mask="0x1" edc:name="SCANTSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANTSEL2" edc:mask="0x1" edc:name="SCANTSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANTSEL3" edc:mask="0x1" edc:name="SCANTSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7A0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x780"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x78C"/>
        <edc:JoinedSFRDef edc:cname="CRCDAT" edc:desc="" edc:name="CRCDAT" edc:nzwidth="0x10" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x791">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CRCDATL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x791">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DAT" edc:mask="0xff" edc:name="DAT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DAT0" edc:mask="0x1" edc:name="DAT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT1" edc:mask="0x1" edc:name="DAT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT2" edc:mask="0x1" edc:name="DAT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT3" edc:mask="0x1" edc:name="DAT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT4" edc:mask="0x1" edc:name="DAT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT5" edc:mask="0x1" edc:name="DAT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT6" edc:mask="0x1" edc:name="DAT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT7" edc:mask="0x1" edc:name="DAT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CRCDAT" edc:mask="0xff" edc:name="CRCDAT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="CRCDAT0" edc:mask="0x1" edc:name="CRCDAT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT1" edc:mask="0x1" edc:name="CRCDAT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT2" edc:mask="0x1" edc:name="CRCDAT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT3" edc:mask="0x1" edc:name="CRCDAT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT4" edc:mask="0x1" edc:name="CRCDAT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT5" edc:mask="0x1" edc:name="CRCDAT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT6" edc:mask="0x1" edc:name="CRCDAT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRDCDAT7" edc:mask="0x1" edc:name="CRDCDAT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CRCDATH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x792">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DAT" edc:mask="0xff" edc:name="DAT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="DAT8" edc:mask="0x1" edc:name="DAT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT9" edc:mask="0x1" edc:name="DAT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT10" edc:mask="0x1" edc:name="DAT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT11" edc:mask="0x1" edc:name="DAT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT12" edc:mask="0x1" edc:name="DAT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT13" edc:mask="0x1" edc:name="DAT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT14" edc:mask="0x1" edc:name="DAT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAT15" edc:mask="0x1" edc:name="DAT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CRCDAT" edc:mask="0xff" edc:name="CRCDAT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="CRCDAT8" edc:mask="0x1" edc:name="CRCDAT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT9" edc:mask="0x1" edc:name="CRCDAT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT10" edc:mask="0x1" edc:name="CRCDAT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT11" edc:mask="0x1" edc:name="CRCDAT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT12" edc:mask="0x1" edc:name="CRCDAT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT13" edc:mask="0x1" edc:name="CRCDAT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT14" edc:mask="0x1" edc:name="CRCDAT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCDAT15" edc:mask="0x1" edc:name="CRCDAT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCACC" edc:desc="" edc:name="CRCACC" edc:nzwidth="0x10" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x793">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCACCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCACCL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x793">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:mask="0xff" edc:name="ACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="ACC0" edc:mask="0x1" edc:name="ACC0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC1" edc:mask="0x1" edc:name="ACC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC2" edc:mask="0x1" edc:name="ACC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC3" edc:mask="0x1" edc:name="ACC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC4" edc:mask="0x1" edc:name="ACC4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC5" edc:mask="0x1" edc:name="ACC5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC6" edc:mask="0x1" edc:name="ACC6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC7" edc:mask="0x1" edc:name="ACC7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CRCACC" edc:mask="0xff" edc:name="CRCACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="CRCACC0" edc:mask="0x1" edc:name="CRCACC0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC1" edc:mask="0x1" edc:name="CRCACC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC2" edc:mask="0x1" edc:name="CRCACC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC3" edc:mask="0x1" edc:name="CRCACC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC4" edc:mask="0x1" edc:name="CRCACC4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC5" edc:mask="0x1" edc:name="CRCACC5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC6" edc:mask="0x1" edc:name="CRCACC6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC7" edc:mask="0x1" edc:name="CRCACC7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCACCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCACCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x794">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:mask="0xff" edc:name="ACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="ACC8" edc:mask="0x1" edc:name="ACC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC9" edc:mask="0x1" edc:name="ACC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC10" edc:mask="0x1" edc:name="ACC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC11" edc:mask="0x1" edc:name="ACC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC12" edc:mask="0x1" edc:name="ACC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC13" edc:mask="0x1" edc:name="ACC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC14" edc:mask="0x1" edc:name="ACC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC15" edc:mask="0x1" edc:name="ACC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CRCACC" edc:mask="0xff" edc:name="CRCACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="CRCACC8" edc:mask="0x1" edc:name="CRCACC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC9" edc:mask="0x1" edc:name="CRCACC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC10" edc:mask="0x1" edc:name="CRCACC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC11" edc:mask="0x1" edc:name="CRCACC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC12" edc:mask="0x1" edc:name="CRCACC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC13" edc:mask="0x1" edc:name="CRCACC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC14" edc:mask="0x1" edc:name="CRCACC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCACC15" edc:mask="0x1" edc:name="CRCACC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
