garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1619.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T2CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T2CKIPPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xE18">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T2PPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2CKIPPS" edc:mask="0x1f" edc:name="T2CKIPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2CKIPPS0" edc:mask="0x1" edc:name="T2CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CKIPPS1" edc:mask="0x1" edc:name="T2CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CKIPPS2" edc:mask="0x1" edc:name="T2CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CKIPPS3" edc:mask="0x1" edc:name="T2CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CKIPPS4" edc:mask="0x1" edc:name="T2CKIPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2PPS" edc:mask="0x1f" edc:name="T2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2PPS0" edc:desc="" edc:mask="0x1" edc:name="T2PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2PPS1" edc:desc="" edc:mask="0x1" edc:name="T2PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2PPS2" edc:desc="" edc:mask="0x1" edc:name="T2PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2PPS3" edc:desc="" edc:mask="0x1" edc:name="T2PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2PPS4" edc:desc="" edc:mask="0x1" edc:name="T2PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T3CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T3CKIPPS" edc:nzwidth="8" edc:por="---10101" edc:_addr="0xE19">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T3CKIPPS" edc:mask="0x1f" edc:name="T3CKIPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3CKIPPS0" edc:desc="" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS1" edc:desc="" edc:mask="0x1" edc:name="T3CKIPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS2" edc:desc="" edc:mask="0x1" edc:name="T3CKIPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS3" edc:desc="" edc:mask="0x1" edc:name="T3CKIPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS4" edc:desc="" edc:mask="0x1" edc:name="T3CKIPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T3GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T3GPPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xE1A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T3GPPS" edc:mask="0x1f" edc:name="T3GPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3GPPS0" edc:desc="" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS1" edc:desc="" edc:mask="0x1" edc:name="T3GPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS2" edc:desc="" edc:mask="0x1" edc:name="T3GPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS3" edc:desc="" edc:mask="0x1" edc:name="T3GPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS4" edc:desc="" edc:mask="0x1" edc:name="T3GPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T4CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T4CKIPPS" edc:nzwidth="8" edc:por="---10001" edc:_addr="0xE1B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T4PPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CKIPPS" edc:mask="0x1f" edc:name="T4CKIPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4CKIPPS0" edc:desc="" edc:mask="0x1" edc:name="T4CKIPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKIPPS1" edc:desc="" edc:mask="0x1" edc:name="T4CKIPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKIPPS2" edc:desc="" edc:mask="0x1" edc:name="T4CKIPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKIPPS3" edc:desc="" edc:mask="0x1" edc:name="T4CKIPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKIPPS4" edc:desc="" edc:mask="0x1" edc:name="T4CKIPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4PPS" edc:mask="0x1f" edc:name="T4PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T4PPS0" edc:mask="0x1" edc:name="T4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4PPS1" edc:mask="0x1" edc:name="T4PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4PPS2" edc:mask="0x1" edc:name="T4PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4PPS3" edc:mask="0x1" edc:name="T4PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4PPS4" edc:mask="0x1" edc:name="T4PPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T5CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T5CKIPPS" edc:nzwidth="8" edc:por="---10000" edc:_addr="0xE1C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T5CKIPPS" edc:mask="0x1f" edc:name="T5CKIPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5CKIPPS0" edc:desc="" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS1" edc:desc="" edc:mask="0x1" edc:name="T5CKIPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS2" edc:desc="" edc:mask="0x1" edc:name="T5CKIPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS3" edc:desc="" edc:mask="0x1" edc:name="T5CKIPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS4" edc:desc="" edc:mask="0x1" edc:name="T5CKIPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
