garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1619.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT2SIGPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SMT2SIGPPS" edc:nzwidth="8" edc:por="---10001" edc:_addr="0xE2C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMT2SIGPPS" edc:mask="0x1f" edc:name="SMT2SIGPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMT2SIGPPS0" edc:desc="" edc:mask="0x1" edc:name="SMT2SIGPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2SIGPPS1" edc:desc="" edc:mask="0x1" edc:name="SMT2SIGPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2SIGPPS2" edc:desc="" edc:mask="0x1" edc:name="SMT2SIGPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2SIGPPS3" edc:desc="" edc:mask="0x1" edc:name="SMT2SIGPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2SIGPPS4" edc:desc="" edc:mask="0x1" edc:name="SMT2SIGPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT2WINPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SMT2WINPPS" edc:nzwidth="8" edc:por="---00011" edc:_addr="0xE2D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMT2WINPPS" edc:mask="0x1f" edc:name="SMT2WINPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMT2WINPPS0" edc:desc="" edc:mask="0x1" edc:name="SMT2WINPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2WINPPS1" edc:desc="" edc:mask="0x1" edc:name="SMT2WINPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2WINPPS2" edc:desc="" edc:mask="0x1" edc:name="SMT2WINPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2WINPPS3" edc:desc="" edc:mask="0x1" edc:name="SMT2WINPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT2WINPPS4" edc:desc="" edc:mask="0x1" edc:name="SMT2WINPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ATCC3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ATCC3PPS" edc:nzwidth="8" edc:por="---10101" edc:_addr="0xE2E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ATCC3PPS" edc:mask="0x1f" edc:name="ATCC3PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ATCC3PPS0" edc:desc="" edc:mask="0x1" edc:name="ATCC3PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC3PPS1" edc:desc="" edc:mask="0x1" edc:name="ATCC3PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC3PPS2" edc:desc="" edc:mask="0x1" edc:name="ATCC3PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC3PPS3" edc:desc="" edc:mask="0x1" edc:name="ATCC3PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC3PPS4" edc:desc="" edc:mask="0x1" edc:name="ATCC3PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="29" edc:beginaddr="0xe80" edc:endaddr="0xeF0" edc:regionid="sfr29">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE80"/>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xE8C"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA0PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE90">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0PPS0" edc:desc="" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS1" edc:desc="" edc:mask="0x1" edc:name="RA0PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS2" edc:desc="" edc:mask="0x1" edc:name="RA0PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS3" edc:desc="" edc:mask="0x1" edc:name="RA0PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS4" edc:desc="" edc:mask="0x1" edc:name="RA0PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA1PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA1PPS0" edc:desc="" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS1" edc:desc="" edc:mask="0x1" edc:name="RA1PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS2" edc:desc="" edc:mask="0x1" edc:name="RA1PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS3" edc:desc="" edc:mask="0x1" edc:name="RA1PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS4" edc:desc="" edc:mask="0x1" edc:name="RA1PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA2PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE92">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA2PPS0" edc:desc="" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS1" edc:desc="" edc:mask="0x1" edc:name="RA2PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS2" edc:desc="" edc:mask="0x1" edc:name="RA2PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS3" edc:desc="" edc:mask="0x1" edc:name="RA2PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS4" edc:desc="" edc:mask="0x1" edc:name="RA2PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xE93"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA4PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE94">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA4PPS0" edc:desc="" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS1" edc:desc="" edc:mask="0x1" edc:name="RA4PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS2" edc:desc="" edc:mask="0x1" edc:name="RA4PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS3" edc:desc="" edc:mask="0x1" edc:name="RA4PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS4" edc:desc="" edc:mask="0x1" edc:name="RA4PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RA5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RA5PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE95">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA5PPS0" edc:desc="" edc:mask="0x1" edc:name="RA5PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS1" edc:desc="" edc:mask="0x1" edc:name="RA5PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS2" edc:desc="" edc:mask="0x1" edc:name="RA5PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS3" edc:desc="" edc:mask="0x1" edc:name="RA5PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RA5PPS4" edc:desc="" edc:mask="0x1" edc:name="RA5PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6" edc:_addr="0xE96"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB4PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE9C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB4PPS0" edc:desc="" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS1" edc:desc="" edc:mask="0x1" edc:name="RB4PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS2" edc:desc="" edc:mask="0x1" edc:name="RB4PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS3" edc:desc="" edc:mask="0x1" edc:name="RB4PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS4" edc:desc="" edc:mask="0x1" edc:name="RB4PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB5PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE9D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB5PPS0" edc:desc="" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS1" edc:desc="" edc:mask="0x1" edc:name="RB5PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS2" edc:desc="" edc:mask="0x1" edc:name="RB5PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS3" edc:desc="" edc:mask="0x1" edc:name="RB5PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS4" edc:desc="" edc:mask="0x1" edc:name="RB5PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB6PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB6PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE9E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB6PPS0" edc:desc="" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS1" edc:desc="" edc:mask="0x1" edc:name="RB6PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS2" edc:desc="" edc:mask="0x1" edc:name="RB6PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS3" edc:desc="" edc:mask="0x1" edc:name="RB6PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS4" edc:desc="" edc:mask="0x1" edc:name="RB6PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB7PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB7PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xE9F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB7PPS0" edc:desc="" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS1" edc:desc="" edc:mask="0x1" edc:name="RB7PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS2" edc:desc="" edc:mask="0x1" edc:name="RB7PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS3" edc:desc="" edc:mask="0x1" edc:name="RB7PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS4" edc:desc="" edc:mask="0x1" edc:name="RB7PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC0PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xEA0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0PPS0" edc:desc="" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS1" edc:desc="" edc:mask="0x1" edc:name="RC0PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS2" edc:desc="" edc:mask="0x1" edc:name="RC0PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS3" edc:desc="" edc:mask="0x1" edc:name="RC0PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS4" edc:desc="" edc:mask="0x1" edc:name="RC0PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
